Repository: 84000/data-translation-memory
Catalog: toh47-v3.tmx
Source language: bo
Languages: en

source: སྡིག་ཅན་ཁྱེད་ནི་མི་མཛའ་བའི་གྲོང་ཁྱེར་ལ་རྒྱལ་པོ་ཆེན་པོ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་རླག་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to destroy you like a great king destroys a city of enemies.

source: སྡིག་ཅན་ཁྱེད་ནི་མི་གཡོ་ཅན་གསད་པར་བྱ་བ་ཤོར་བ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་འབྲོས་པར་བྱེད་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to make you run away like a criminal trying to escape from an execution.

source: སྡིག་ཅན་ཁྱེད་ནི་ཚོང་པ་ལམ་རྒྱགས་མང་པོ་མེས་ཚིག་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་མགོ་འཁོར་བར་བྱེད་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to confound you like a conflagration confounds a merchant loaded with provisions for the road.

source: སྡིག་ཅན་ཁྱེད་ནི་ཆོས་ཀྱི་རྒྱལ་པོ་རྒྱལ་སྲིད་ཉམས་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་མྱ་ངན་བྱེད་དུ་བཅུག་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to make you suffer like an unrighteous king who is exiled from his kingdom.

source: སྡིག་ཅན་ཁྱེད་ནི་ཁྲུང་ཁྲུང་རྒན་པོ་འདབ་མ་བྲེགས་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་སེམས་ཁོངས་སུ་བཅུག་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to make you hang your heads like an old curlew whose wings have been clipped.

source: སྡིག་ཅན་ཁྱེད་ནི་འབྲོག་དགོན་པར་ལམ་རྒྱགས་ཆད་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་ཕོངས་པར་བྱས་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to strike a blow upon you like a group of travelers in the wilderness who have just exhausted their provisions.

source: སྡིག་ཅན་ཁྱེད་ནི་རྒྱ་མཚོ་ཆེན་པོའི་དབུས་སུ་གྲུ་ཞིག་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་སྨྲེ་སྔགས་འདོན་དུ་བཅུག་པར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to make you flail about like passengers whose ship has wrecked in the middle of the ocean.

source: སྡིག་ཅན་ཁྱེད་ནི་བསྲེག་པའི་བསྐལ་པས་རྩྭ་དང་ནགས་ཚལ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་རྙིས་པར་བྱས་པར་འགྱུར་རོ། །
en: Evil ones, today the bodhisattva is going to make you wither like the grass and forests during the conflagration at the end of an eon.

source: སྡིག་ཅན་ཁྱེད་ནི་རྡོ་བ་ལ་རྡོ་རྗེ་ཆེན་པོ་བབ་པ་ལྟར་དོ་མོད་བྱང་ཆུབ་སེམས་དཔས་རྣམ་པར་གཏོར་བར་འགྱུར་རོ། །
en: Evil ones, today the Bodhisattva is going to pulverize you like stones being struck with a great vajra.’

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་བསྙེན་བཀུར་བའི་ལྷ་རྣམས་ཀྱིས་བཟློག་པ་རྣམ་པ་བཅུ་དྲུག་གིས་བདུད་སྡིག་ཅན་རྣམས་ཟློག་པར་བྱེད་ཀྱང་བདུད་སྡིག་ཅན་དེ་དག་ཕྱིར་མ་ལོག་གོ །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གྲངས་མེད་པ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་སྦྱིན་པ་དང་། དུལ་བ་དང་། ལེགས་པར་སྡོམ་པ་དང་། ཚུལ་ཁྲིམས་དང་། བཟོད་པ་དང་།
en: “However, Śāntamati, even though the deities who attended upon the tree of awakening sought to dissuade those evil māras with the sixteen forms of dissuasion, the māras did not turn back.

source: བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་དང་། བྱམས་པ་དང་། སྙིང་རྗེ་དང་། དགའ་བ་དང་། བཏང་སྙོམས་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ལམ་དང་། ཞི་གནས་དང་། ལྷག་མཐོང་དང་། རིག་པ་དང་། རྣམ་པར་གྲོལ་བ་ཡོངས་སུ་སྦྱང་བ་བྱས་པས་ལག་པ་གཡས་པ་འཇམ་ཞིང་གཞོན་ལ་ཤིན་ཏུ་གཞོན་པ་གསེར་གྱི་ཁ་དོག་ལྟར་འདུག་པ་བརྐྱང་སྟེ།
en: At that point, Śāntamati, the Bodhisattva raised his right arm, which was golden-colored, soft, youthful, full of vitality, and had made the preparations for liberation and the knowledges by practicing generosity, self-discipline, restraint, moral conduct, patience, heroic effort, meditation, wisdom, love, compassion, joy, equanimity, the applications of mindfulness, the right efforts, the foundations for superhuman power, the spiritual faculties, the powers, the constitutive factors of awakening, calm abiding, and deep insight for incalculable hundreds of thousands of millions and billions of eons, and he wiped his whole body clean, including the top of his head.

source: སྙིང་རྗེ་ཆེན་པོས་བསྐྱོད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་ཐར་བར་བྱ་བའི་ལྷག་པའི་བསམ་པས་སྤྱི་བོ་ནས་བཟུང་སྟེ། ལུས་ཐམས་ཅད་ལ་བྱུགས་ནས་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་མངོན་དུ་བྱས་ཏེ་དྲན་པ་དང་ལྡན་ཞིང་ཤེས་བཞིན་དུས་ཆེན་པོ་ལ་བརྡབས་སོ། །
en: Then, directed by great compassion and with the ambition to bring about the liberation of all beings, he brought down the blessed buddhas in all the worlds directly before him, and with attention and full awareness, he touched the great earth with his hand.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔས་ས་ཆེན་པོ་ལ་བརྡབས་མ་ཐག་ཏུ་དེ་ནས་དེའི་ཚེ་ས་ཆེན་པོ་རྣམ་པ་དྲུག་ཏུ་གཡོས་སོ། །
en: “Just as soon as the Bodhisattva touched the great earth, Śāntamati, at that very moment the great earth shook in six ways.

source: རབ་ཏུ་གཡོས་སོ།།ཀུན་ཏུ་རབ་ཏུ་གཡོས་སོ། །
en: It quaked, it quivered, it trembled;

source: འགུལ་ཏོ། །རབ་ཏུ་འགུལ་ཏོ། །
en: it wobbled, it wavered, it swayed;

source: ཀུན་ཏུ་རབ་ཏུ་འགུལ་ཏོ། །ལྡེག་གོ། །རབ་ཏུ་ལྡེག་གོ། །ཀུན་ཏུ་རབ་ཏུ་ལྡེག་གོ། །འཁྲུགས་སོ། །
en: it teetered, it tottered, it tremored;

source: རབ་ཏུ་འཁྲུགས་སོ། །ཀུན་ཏུ་རབ་ཏུ་འཁྲུགས་སོ། །འུར་འུར་རོ། །རབ་ཏུ་འུར་འུར་རོ། །
en: it shook, it shivered, it shuddered;

source: ཀུན་ཏུ་རབ་ཏུ་འུར་འུར་རོ། །
en: it rattled, it rolled, and it clattered.

source: ཆེམ་ཆེམ་མོ། །
en: It boomed;

source: རབ་ཏུ་ཆེམ་ཆེམ་མོ། །
en: it thundered;

source: ཀུན་ཏུ་རབ་ཏུ་ཆེམ་ཆེམ་མོ། །
en: it rumbled.

source: ཤར་ཕྱོགས་དམའ་ན་ནུབ་ཕྱོགས་མཐོའོ། །
en: When the eastern side fell, the western side rose.

source: ནུབ་ཕྱོགས་དམའ་ན་ཤར་ཕྱོགས་མཐོའོ། །
en: When the western side fell, the eastern side rose.

source: ལྷོ་ཕྱོགས་དམའ་ན་བྱང་ཕྱོགས་མཐོའོ། །
en: When the southern side fell, the northern side rose.

source: བྱང་ཕྱོགས་དམའ་ན་ལྷོ་ཕྱོགས་མཐོའོ། །
en: When the northern side fell, the southern side rose.

source: མཐའ་མཐོ་ན་དབུས་དམའོ། །
en: When the edges fell, the middle rose.

source: དབུས་མཐོ་ན་མཐའ་དམའོ། །
en: When the middle fell, the edges rose.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་རྣམ་པ་དྲུག་དང་། ལྟས་ཆེན་པོ་བཅྭ་བརྒྱད་དུ་ས་གཡོས་པ་ཆེན་པོ་འཇིག་རྟེན་དུ་བྱུང་བར་གྱུར་ཏོ། །
en: In this way, Śāntamati, a great earthquake occurred in the world at that moment in these six ways and with these eighteen indications of its magnitude.

source: བདུད་སྡིག་ཅན་རྣམས་ཀྱིས་ཀྱང་འུར་སྒྲ་དང་། ཏུག་ཆེམ་གྱི་སྒྲ་ཆེན་པོ་དང་། ཟུང་ཤིག་དང་། རྒྱོབ་ཅིག་པ་དང་། ཆིངས་ཤིག་པ་དང་།
en: “Still, the evil māras could be heard making a great noise, with sounds like ‘Phucchak!’ ‘Picik!’ ‘Seize him!’ ‘Strike him!’ ‘Bind him!’

source: སོད་ཅིག་པའི་སྒྲ་ཐོས་སོ། །
en: “Then, through the majestic power of the Bodhisattva, the assembly of māras heard a voice calling out from the sky above them.

source: བདུད་ཀྱི་འཁོར་གྱིས་ནི་བྱང་ཆུབ་སེམས་དཔའི་མཐུས་སྟེང་གི་བར་སྣང་ལ་འདི་ལྟ་བུའི་སྒྲ་འདི་ཐོས་སོ། །
en: It sounded like this:

source: དྲང་སྲོང་ནང་ན་དྲང་སྲོང་མཆོག །
en: “ ‘You should go for refuge to this seer Who maintains perfect moral conduct.

source: འདི་ནི་མི་འཇིགས་སྦྱིན་པ་སྟེ། །
en: For he is the giver of fearlessness;

source: སྲོག་ཆགས་ཀུན་གྱི་སྐྱབས་ཡིན་གྱིས། །འདི་ལ་སྐྱབས་སུ་འགྲོ་བར་གྱིས། །
en: He is protector of all embodied beings.’

source: ཞི་བའི་བློ་གྲོས་བདུད་ཀྱི་འཁོར་གྱིས་སྒྲ་དེ་ཐོས་པ་དང་། གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུ་ཁས་བུབ་ཏུ་ས་ལ་སྒྱེལ་ནས་སྐྱེས་བུ་ཆེན་པོ་ཡོངས་སུ་བསྐྱབ་ཏུ་གསོལ།
en: “When the assembly of māras heard this voice, Śāntamati, eight millions of billions upon billions of yakṣas fell down upon the surface of the earth, face-down on the ground, and they cried, ‘Protect us!’

source: ཡོངས་སུ་བསྐྱབ་ཏུ་གསོལ། ཞེས་ཚིག་དེ་སྐད་སྨྲས་སོ། །བདུད་སྡིག་ཅན་ལྷག་མ་རྣམས་ནི་དཔུང་གི་ཚོགས་དང་ལྷན་ཅིག་ཏུ་འབྲོས་པར་འདོད་ན་འབྲོས་མ་ནུས་ནས་དེ་དག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་ལུས་ལས་འོད་ཕྱུང་བ་དང་།
en: “The remaining māras and their armed forces wanted to flee, but they were unable to flee.

source: འོད་དེས་དེ་དག་འཇིགས་པ་ཐམས་ཅད་དང་བྲལ་ཏེ། རང་རང་གི་གནས་སུ་དོང་ངོ་། །ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔས་བདུད་འདུལ་བའི་རྣམ་པར་སྤྲུལ་པ་འདི་བསྟན་པ་ན་བདུད་ཀྱི་འཁོར་དེ་ལས་གནོད་སྦྱིན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་བརྒྱད་ཅུས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: So, out of compassion for them, the Bodhisattva released a ray of light from his body that made all their fears disappear and returned them to their own abodes.

source: སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ཕྲག་དགུ་བཅུ་རྩ་དགུས་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། ལྷའི་བུ་སྔོན་སྦྱང་བ་བྱས་པ་བརྒྱད་ཁྲི་བཞི་སྟོང་ནི་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་ཐོབ་པར་གྱུར་ཏོ། །
en: “While the Bodhisattva was showing the conquest of the māras to be child’s play for him, Śāntamati, the eight millions of billions upon billions of yakṣas who were in the assembly of māras conceived the aspiration for unsurpassable and perfect awakening, a further ninety-nine thousand millions and billions of other beings conceived the aspiration for unsurpassable and perfect awakening, and eighty-four thousand divine beings who had already completed the preparations for it attained acceptance of the fact that things do not arise.”

source: བདུད་བཏུལ་བའི་ལེའུ་ཞེས་བྱ་བ་སྟེ་བཅུ་གསུམ་པའོ།། །།
en: This was the thirteenth chapter, “The Taming of the Māras.” Chapter 14: The Turning of the Wheel of Dharma

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ལྷ་དང་མི་ཁ་ཅིག་གིས་ནི་དེ་ལྟར་བདུད་འདུལ་བ་ཚད་མེད་པ་དང་ལྡན་པར་ཤེས་སོ། །ཁ་ཅིག་གིས་ནི་བདུད་ཡོང་ཐམས་ཅད་དུ་མ་འོངས་པར་ཤེས་སོ། །
en: “Indeed, Śāntamati, some gods and humans thought that the conquest of the māras had immeasurable differences in this way, while some thought that Māra was not approaching in any way at all.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རྩྭ་བཏིང་བ་ལ་འདུག་པར་ཤེས་སོ། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་པད་མ་བཀོད་པའི་སེང་གེའི་ཁྲི་ལ་འདུག་པར་མཐོང་ངོ་། །
en: Some thought the Bodhisattva was seated upon a mat of grass, while some saw the Bodhisattva seated upon a lion’s seat resting on a splendid arrangement of lotus flowers made of jewels.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ས་ལ་འདུག་པར་མཐོང་ངོ་། །ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་དཀྱིལ་ན་གནས་པའི་སེང་གེའི་ཁྲི་ལ་འདུག་པར་མཐོང་ངོ་། །
en: Some saw the Bodhisattva situated upon the surface of the earth, while some saw the Bodhisattva seated upon a lion’s seat situated in the vault of the sky.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཤིང་གི་རྒྱལ་པོ་ཨ་ཤྭད་ཐར་མཐོང་ངོ་། །
en: Some saw the tree of awakening as the king of trees, the sacred fig tree;

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཡོངས་འདུས་བརྟོལ་དུ་མཐོང་ངོ་། །
en: some saw it as the divine Pārijāta tree;

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་རང་བཞིན་ཅན་དུ་མཐོང་ངོ་། །
en: some saw it as the divine Kovidāra grove. Some saw the tree of awakening as entirely made of jewels.

source: ལྷ་དང་མི་ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཤིང་ཏ་ལ་སྲིད་ཙམ་དུ་མཐོང་ཞིང་སེང་གེའི་ཁྲི་ཤིང་ཏ་ལ་ཕྱེད་ཙམ་དུ་མཐོང་ངོ་། །
en: Some gods and humans saw the tree of awakening as being equal in height to a palm tree, and they saw the lion’s seat as equal to half the height of a palm tree.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་ཤིང་ཏ་ལ་བདུན་སྲིད་ཙམ་དུ་མཐོང་ཞིང་སེང་གེའི་ཁྲི་ཤིང་ཏ་ལ་ཕྱེད་དང་གཉིས་ཀྱི་སྲིད་ཙམ་དུ་མཐོང་ངོ་། །
en: Some saw the tree of awakening as being equal in height to seven palm trees, and they saw the lion’s seat to be equal in height to three and a half palm trees.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་ཀྱི་ཤིང་དཔག་ཚད་བརྒྱད་ཁྲི་བཞི་སྟོང་པའི་བར་དུ་མཐོང་ཞིང་སེང་གེའི་ཁྲི་དཔག་ཚད་བཞི་ཁྲི་ཉིས་སྟོང་བར་མཐོང་ངོ་། །
en: Some saw the tree of awakening to be eighty-four thousand leagues in height and the lion’s seat to be forty-two thousand leagues in height.

source: ལྷ་དང་མི་ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་འདུལ་བར་མཐོང་ངོ་། །
en: “Now, some gods and humans saw the Bodhisattva conquering Māra.

source: ཁ་ཅིག་གིས་ནི་བདུད་གཅིག་མཐོང་ངོ་། །
en: Some saw only one māra.

source: ཁ་ཅིག་གིས་ནི་བདུད་རྒྱ་ཆེན་པོར་མཐོང་ངོ་། །
en: Some saw a vast army of māras.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་བདུད་འཇོམས་པ་ལ་རྩེ་བར་མཐོང་ངོ་། །
en: Some saw the Bodhisattva making child’s play out of defeating Māra.

source: ཁ་ཅིག་གིས་ནི་བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་དཀྱིལ་ན་གནས་ཤིང་ནམ་མཁའ་ལ་འདུག་པའི་བྱང་ཆུབ་ཀྱི་ཤིང་དྲུང་ན་སེང་གེའི་ཁྲི་ལ་འདུག་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མཐོང་སྟེ།
en: Some saw the bodhisattva up in the vault of the sky at the same time as he was awakening to supreme awakening while being seated upon the lion’s seat at the base of the tree of awakening.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ནི་ཡུལ་མཐའ་མེད་པ་ཡིན་ཏེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ན་འཁོད་པ་དེ་དག་གི་ཡོན་ཏན་གྱི་རྒྱུའི་ཁྱད་པར་ནི་ཚད་མེད་པར་སྣང་ངོ་། །
en: Indeed, Śāntamati, bodhisattvas have immeasurable capacity.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་འདུག་པ་དང་།
en: The particular conditions and qualities of those who have gone to the supreme point of the seat of awakening have appeared in truly immeasurable ways.

source: སྔོན་འཐུན་པར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ཚད་མེད་གྲངས་མེད་པ་དག་ནས་ལྷགས་ཏེ། མི་འཇིགས་པའི་སྒྲ་རྗོད་ཅིང་ཤིས་པའི་སྒྲ་དང་། བདེ་བའི་སྒྲ་དང་། ཀུན་དགའ་བའི་སྒྲ་དང་། མགྱོགས་པའི་སྒྲ་དང་། མྱུར་བའི་སྒྲ་དང་། ལེགས་པའི་སྒྲ་དང་། དོན་ཡོད་པའི་སྒྲ་དང་། དཔའ་བའི་སྒྲ་དང་། སྐྱེས་བུ་དམ་བའི་སྒྲ་དང་།
en: “What is more, Śāntamati, when the Bodhisattva had gone to the supreme point of the seat of awakening, an immeasurable, incalculable number of bodhisattvas, whose past actions were in the same category as his own, came from immeasurable, incalculable worlds throughout the ten directions, and they urged him on by uttering words to him.

source: ཕྱིར་མི་ལྡོག་པའི་སྒྲ་དང་། རྒྱས་པའི་སྒྲ་དང་། བཀྲ་ཤིས་པའི་སྒྲ་དང་། མི་གདུང་བའི་སྒྲ་དང་། མ་ཞུམ་པའི་སྒྲ་དང་། སྔོན་གྱི་བསམ་པའི་སྒྲ་དང་། སྤོང་བ་དོན་ཡོད་པའི་སྒྲ་དང་། ཡིད་བདེ་བའི་སྒྲ་དང་། རྡོ་རྗེ་ལྟར་མཁྲེགས་པའི་སྒྲ་དང་། སྐྱེས་བུ་དམ་པ་རྩེན་པའི་སྒྲ་དང་། ཕན་པའི་སྒྲ་དང་། སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་སྒྲ་དང་།
en: They said the word ‘fearlessness,’ and the word ‘security,’ and the words ‘happiness’ and ‘bliss.’ They said the words ‘haste’ and ‘speed.’ They said the word ‘bravo!’ They urged him on by uttering the words ‘success,’ ‘valor,’ ‘good man,’ ‘irreversible one,’ ‘nourishment,’ ‘auspicious,’ ‘no more pain,’ ‘no fatigue,’ ‘past motivation,’ ‘unfailing effort,’ ‘cheerfulness,’ ‘rock-solid as a vajra,’ ‘the child’s play of a good man,’ ‘benefit,’ ‘connecting with awakening in a single moment,’ ‘the knowledge of an omniscient one,’ and ‘complete awakening.’

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་སྒྲ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པའི་སྒྲ་རྗོད་དེ། །ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་དབུགས་འབྱིན་པ་རྣམ་པ་སྣ་ཚོགས་བརྒྱ་སྟོང་དག་གིས་དབུགས་འབྱིན་ཏོ། །
en: “In this way, Śāntamati, the bodhisattvas who had gathered there from the worlds throughout the ten directions cheered on the Bodhisattva who had gone to the supreme point of the seat of awakening with thousands of different words of encouragement.

source: མཆོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱེད་དོ། །བསྟོད་པ་རྣམ་པ་སྣ་ཚོགས་བྱེད་དོ། །འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་སྔོན་ལེགས་པར་སྤྱད་པ་སྟེ།
en: They performed various forms of worship, and they extolled him with hymns of various sorts.

source: དེས་ན་ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་ནས་འདུས་པའི་བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པ་ལ་འདུག་པ་ལ་དབུགས་འབྱིན་ཅིང་མཆོད་པ་བྱེད་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་དེ་ལ་ཡང་རྗེས་སུ་ཆགས་པ་མེད་ལ་བདུད་ཀྱི་སྡེ་ལ་ཡང་ཁོང་ཁྲོ་བ་མེད་དོ། །
en: The Bodhisattva’s past actions were done well, and thus the bodhisattvas who had gathered there from the worlds throughout the ten directions cheered on the Bodhisattva who had gone to the supreme point of the seat of awakening and they worshiped him. Nevertheless, he did not feel any affection for them, nor did he feel any anger toward the army of māras.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་སེམས་དཔའ་རྗེས་སུ་ཆགས་པ་དང་། ཁོང་ཁྲོ་བ་དང་བྲལ་བས་སྐད་ཅིག་གཅིག་དང་ལྡན་པའི་ཤེས་རབ་ཀྱིས་ཤེས་པར་བྱ་བ་དང་། བལྟ་བར་བྱ་བ་དང་། ཐོབ་པར་བྱ་བ་དང་། མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་བྱ་བ་གང་ཅི་ཡང་རུང་སྟེ་དེ་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་སོ། །
en: “Being free of affection and anger, Śāntamati, and with the wisdom that is connected with awakening in a single moment of thought, the Bodhisattva then awakened fully to that which should be known, to that which should be seen, to that which should be attained, to all that to which one should be fully awakened—that is, complete awakening.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་བརྙེས་པའི་དེ་བཞིན་གཤེགས་པ་ལ་ཕྱོགས་བཅུ་ནས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་གྲངས་མེད་དཔག་ཏུ་མེད་པ་དག་གིས་ཕྱག་གཡས་པ་བརྐྱང་སྟེ། སྐུ་མ་མཉེལ་ཏམ་ཞེས་སྙུན་གསོལ་ལོ། །མཉེལ་བ་མི་མངའ་བར་བྱང་ཆུབ་བམ། རང་བྱུང་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། སྒྲིབ་པ་མི་མངའ་བར་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། མཉམ་པ་ཉིད་ཀྱི་ཡེ་ཤེས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། ཀུན་ཏུ་ཡེ་ཤེས་ཀྱིས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་བམ། སྤྱོད་ཡུལ་མ་འདྲེས་པ་དང་ལྡན་ནམ། སྙིང་རྗེ་ཆེན་པོའི་གོ་ཆ་བགོས་སམ།
en: “Moreover, Śāntamati, when the Realized One had achieved awakening, an immeasurable and incalculable number of blessed buddhas from throughout the ten directions extended their right hands to him, and they asked him, ‘Is your body not tired?’ And they asked, ‘Have you become awakened to the tireless state?’ and, ‘Have you become awakened to the state of ease?’ ‘Have you become awakened completely to what is self-arisen?’ ‘Have you awakened to what is not hindered?’ And they asked him, ‘Have you awakened through the knowledge of sameness?’ ‘Have you awakened through omnipresent knowledge?’ ‘Do you have as your scope what is unadulterated?’ ‘Are you wearing the armor of great compassion?’ ‘Have you made sure the lineage of the Three Jewels remains unbroken?’ And they asked him, ‘Have you gained mastery over all things?’

source: དཀོན་མཆོག་གསུམ་གྱི་རིགས་བསབས་སམ། ཆོས་ཐམས་ཅད་ལ་དབང་སྒྱུར་རམ་ཞེས་ཡོངས་སུ་འདྲིའོ། །དེ་ལ་སེམས་ཅན་གང་དག་དབང་པོ་ཡོངས་སུ་སྨིན་པ་དེ་དག་གིས་ནི་བྱ་བ་དེ་ཤེས་སོ། །སེམས་ཅན་གང་དག་དབང་པོ་ཡོངས་སུ་མ་སྨིན་པ་དེ་དག་གིས་ནི་བྱ་བ་དེ་མི་ཤེས་སོ། །
en: “In this respect, those beings whose spiritual faculties had reached maturity were aware of the activity of the realized ones, whereas those beings whose spiritual faculties were still immature were unaware of it.

source: ཞི་བའི་བློ་གྲོས་བྱང་ཆུབ་བརྙེས་པའི་དེ་བཞིན་གཤེགས་པ་ཞག་བདུན་གྱི་བར་དུ་སྤྱན་མི་འཛུམས་པར་ཆོས་ཀྱི་དགའ་བའི་བདེ་བ་ཉམས་སུ་བསྟར་རོ། །
en: “Moreover, Śāntamati, once the Realized One had attained awakening he experienced the happiness that finds pleasure in the Dharma for seven nights without closing his eyes.

source: སྤྱན་མི་འཛུམས་པར་བྱང་ཆུབ་ཀྱི་ཤིང་ལ་ཡང་གཟིགས་སོ། །
en: He also gazed at the tree of awakening without closing his eyes.

source: ལྷའི་བུ་སྟོང་ཡང་དེ་ལ་མཆོད་དོ། །བསྟོད་དོ། །ཕྱག་འཚལ་ལོ། །ལྷའི་བུ་མོ་བརྒྱ་སྟོང་དག་ཀྱང་དེ་ལ་མཆོད་པ་བྱེད་དོ། །
en: Hundreds of thousands of gods also worshiped him, sang songs of praise to him, and bowed down before him.

source: བསྟོད་དོ། །ཕྱག་འཚལ་ལོ། །
en: Hundreds of thousands of apsarases also worshiped him, sang songs of praise to him, and bowed down before him.

source: དེ་བཞིན་གཤེགས་པའི་སྤྱོད་ལམ་མཐོང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་ཀྱང་བསྐྱེད་དོ། །
en: When they saw the Realized One’s demeanor, they also conceived the aspiration for unsurpassable, perfect, and complete awakening.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་བརྙེས་པ་དང་། རྒྱལ་པོ་ཆེན་པོ་བཞི་ལྷུང་བཟེད་རྣམས་ཐོགས་ཏེ་དེ་བཞིན་གཤེགས་པའི་གན་དུ་དོང་བར་གྱུར་ཏོ། །བཞི་གང་ཞེ་ན།
en: “Moreover, Śāntamati, when the Realized One had attained awakening, the Four Great Kings approached him bearing alms bowls.

source: ཡུལ་འཁོར་སྲུང་དང་། འཕགས་སྐྱེས་པོ་དང་། མིག་མི་བཟང་དང་། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་སྟེ་རྒྱལ་པོ་ཆེན་པོ་བཞི་པོ་དེ་དག་གོ། །གླིང་བཞི་པ་འདི་ནས་ཇི་ལྟར་དོང་བ་དེ་བཞིན་དུ་གླིང་བཞི་པ་བྱེ་བ་ཕྲག་བརྒྱ་ནས་རྒྱལ་པོ་ཆེན་པོ་བྱེ་བ་ཕྲག་བཞི་བརྒྱ་ལྷུང་བཟེད་རྣམས་ཐོགས་ཏེ་དེ་བཞིན་གཤེགས་པའི་གན་དུ་དོང་ངོ་། །
en: Just as they came from this world of four continents, in the same way four billion more great kings from a billion more worlds with four continents also approached the Realized One, and they were bearing alms bowls, too.

source: ཞི་བའི་བློ་གྲོས་དེ་ལ་དེ་བཞིན་གཤེགས་པས་ལྷུང་བཟེད་བྱེ་བ་ཕྲག་བཞི་བརྒྱ་རྣམས་བཞེས་ཏེ།
en: In this regard, Śāntamati, the Realized One accepted these four billion alms bowls, and having accepted them he made them into a single alms bowl through the force of his empowering authority.

source: བཞེས་ནས་ཀྱང་ལྷུང་བཟེད་གཅིག་ཏུ་བྱིན་གྱིས་བརླབས་ནས་རྒྱལ་པོ་ཆེན་པོ་རེ་རེ་ཡང་འདི་སྙམ་དུ་དེ་བཞིན་གཤེགས་པས་བདག་གི་ལྷུང་བཟེད་བཞེས་སོ། །དེ་བཞིན་གཤེགས་པས་བདག་གི་ལྷུང་བཟེད་དུ་གསོལ་ལོ་སྙམ་དུ་སེམས་ཏེ།
en: Still, each of the great kings had the thought, ‘The Realized One has accepted my alms bowl!

source: དེ་དག་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: The Realized One will eat from my alms bowl!’ As a result of the joy and pleasure they felt at this very thought, they all became unable to be turned back from unsurpassable, perfect awakening.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་བརྙེས་ནས་ཚོང་པ་ག་གོན་དང་བཟང་པོ་དང་། གཞན་ཡང་ལྷའི་བུ་དྲུག་ཁྲི་དེ་བཞིན་གཤེགས་པའི་ཐོག་མའི་ཞལ་ཟས་ཐོགས་ནས་དོང་བར་གྱུར་ཏེ། དེ་དག་ནི་སྔོན་འདི་སྐད་དུ་བདག་ཅག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཐོག་མར་ཞལ་ཟས་དབུལ་ལོ་ཞེས་སྨོན་ལམ་བཏབ་པར་གྱུར་པ་དག་གོ། །
en: “Moreover, Śāntamati, once the Realized One had attained awakening, the merchants Trapuṣa and Bhallika, and another sixty thousand gods, approached the Realized One carrying his first meal, and gave it to him.

source: དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་ཐོག་མར་ཞལ་ཟས་ཕུལ་ནས་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དེ་ཉིད་ཀྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཏོ། །
en: They had made the prior vow, ‘We will be the first to provide the Realized One with a meal.’ Once they had provided the Realized One with his first meal, they became unable to be turned back from unsurpassable, perfect awakening as a result of the joy and pleasure they felt at this very act.

source: ཞི་བའི་བློ་གྲོས་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་མཆོག་དམ་པར་འདུག་སྟེ་ཐམས་ཅད་མཁྱེན་པ་མ་ཐོབ་པ་ལས་བྱང་ཆུབ་བརྙེས་པ་དང་། དེ་བཞིན་གཤེགས་པས་ཆོས་ཀྱི་འཁོར་ལོ་མ་བསྐོར་བའི་བར་དུ་སེམས་ཅན་གྱི་དོན་མཛད་པ་དེ་ནི་རབ་ཏུ་མང་གི། །
en: “Indeed, Śāntamati, when he had gone to the supreme point of the seat of awakening, the Bodhisattva worked for the benefit of beings even before he had achieved the knowledge of an omniscient one, and once he had achieved awakening, the Realized One worked for the benefit of beings even before he turned the wheel of the Dharma, and he did so to a great extent.

source: སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ་བྱང་ཆུབ་ཀྱི་སྙིང་པོར་སོང་བའི་བར་དུ་ནི་དེ་ལྟ་མ་ཡིན་ནོ། །
en: It isn’t that he only did so from the time when he first conceived the aspiration for awakening until he reached the seat of awakening.

source: ཞི་བའི་བློ་གྲོས་ཁྱོད་ཀྱིས་རྣམ་གྲངས་འདིས་ཀྱང་ཇི་ལྟ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ལ་ཉེ་བར་གྱུར་པ་དེ་ལྟ་དེ་ལྟར་སེམས་ཅན་ཚད་མེད་པའི་དོན་བྱེད་པ་དེ་ལྟར་ཤེས་པར་བྱའོ། །
en: In this way, too, Śāntamati, one should understand that by the very act of being seated for awakening—just by that very act—a bodhisattva works for the benefit of immeasurable beings.

source: ཞི་བའི་བློ་གྲོས་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་བརྙེས་ནས་ཚངས་པ་གཙུག་ཕུད་ཅན་ཞེས་བྱ་བ་ཚངས་རིས་ཀྱི་ལྷའི་བུ་འབུམ་ཕྲག་དྲུག་ཅུ་རྩ་བརྒྱད་ཀྱིས་བསྐོར་ཅིང་མདུན་དུ་བདར་ཏེ་ཚངས་པའི་འཇིག་རྟེན་ནས་མི་སྣང་བར་གྱུར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་ཕྱིན་ཏེ།
en: “Moreover, Śāntamati, when the Realized One had attained awakening, Brahmā Śikhin vanished from the Brahmā world and, accompanied and preceded by six million eight hundred thousand gods from the Heaven of Brahmā’s Assembly, he appeared right in front of the Blessed One.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ནས་ལན་བདུན་བསྐོར་བ་བྱས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཕྱིར་སེམས་ཅན་ཆོས་ཀྱི་སྣོད་དུ་གྱུར་པ་དག་མཆིས་ཏེ། དེ་དག་དེ་བཞིན་གཤེགས་པའི་ཆོས་བསྟན་པ་འཚལ་བར་འགྱུར་གྱིས། བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་བསྟན་དུ་གསོལ།
en: He bowed his head at the feet of the Blessed One and walked around him seven times, keeping him on the right, and entreated the Blessed One, ‘Teach the Dharma, Blessed One, so that the wheel of Dharma may be set in motion!

source: བདེ་བར་གཤེགས་པས་ཆོས་བསྟན་དུ་གསོལ། ཞེས་གསོལ་བ་བཏབ་བོ། །
en: Teach the Dharma, Sublime One!
